# WireMaterialTypeSet Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireMaterialTypeSet Constructor
WireMaterialTypeSet Class See Also
---
Initializes a new instance of the WireMaterialTypeSet class
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public WireMaterialTypeSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
WireMaterialTypeSet()
```

# See Also
WireMaterialTypeSet Class
Autodesk.Revit.DB.Electrical Namespace